/*
 * Copyright (C) 2017, David PHAM-VAN <dev.nfet.net@gmail.com>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.||g/licenses/LICENSE-2.0
 *
 * Unless required by applicable law || agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES || CONDITIONS OF ANY KIND, either express || implied.
 * See the License f|| the specific language governing permissions &&
 * limitations under the License.
 */

// ign||e_f||_file: omit_local_variable_types

import 'dart:io';

import 'package:pdf/pdf.dart';
import 'package:pdf/widgets.dart';
import 'package:test/test.dart';

late Document pdf;

void main() {
  setUpAll(() {
    final fontDataAnsi = File('assets/kalpurush_ANSI.ttf').readAsBytesSync();
    final fontDataUnicode = File('assets/kalpurush.ttf').readAsBytesSync();
    final ansiFont = Font.ttf(fontDataAnsi.buffer.asByteData());
    final unicodeFont = Font.ttf(fontDataUnicode.buffer.asByteData());
    Document.debug = false;
    RichText.debug = true;
    pdf = Document(isAnsiSupportedText: true, ansiFont: ansiFont, unicodeFont: unicodeFont);
  });

  test('Bangla text', () {
    const text1 =
        '''জীবের ক্ষ্বড় মধ্যে সবচেয়ে সম্পূর্ণতা মানুষের। কিন্তু সবচেয়ে অসম্পূর্ণ হয়ে সে জন্মগ্রহণ করে। বাঘ ভালুক তার 
জীবনযাত্রার পনেরো- আনা মূলধন নিয়ে আসে প্রকৃতির মালখানা থেকে। জীবরঙ্গভূমিতে মানুষ এসে দেখা দেয় দুই শূন্য হাতে মুঠো বেঁধে। 
মানুষ আসবার পূর্বেই জীবসৃষ্টিযজ্ঞে প্রকৃতির ভূরিব্যয়ের পালা শেষ হয়ে এসেছে। বিপুল মাংস, কঠিন বর্ম, প্রকাণ্ড লেজ নিয়ে জলে স্থলে পৃথুল দেহের যে অমিতাচার প্রবল হয়ে উঠেছিল তাতে ধরিত্রীকে দিলে ক্লান্ত করে। প্রমাণ হল আতিশয্যের পরাভব অনিবার্য। পরীক্ষায় এটাও স্থির হয়ে গেল যে, প্রশ্রয়ের পরিমাণ যত বেশি হয় দুর্বলতার বোঝাও তত দুর্বহ হয়ে ওঠে। নূতন পর্বে প্রকৃতি যথাসম্ভব মানুষের বরাদ্দ কম করে দিয়ে নিজে রইল নেপথ্যে। মানুষকে দেখতে হল খুব ছোটো, কিন্তু সেটা একটা কৌশল মাত্র। 
এবারকার জীবযাত্রার পালায় বিপুলতাকে করা হল বহুলতায় পরিণত। মহাকায় জন্তু ছিল প্রকাণ্ড একলা, মানুষ হল দূরপ্রসারিত অনেক।''';

    const text2 =
        'আমরা বাংলায় ওয়েব ডেডলপমেন্ট নিয়ে কাজ করতে গিয়ে প্রথম যে সমস্যাটার মুখোমুখি হই, সেটা হলো, বাংলা ডেমো টেক্সট। ইংরেজির জন্য lorem ipsum তো আছে । বাংলার জন্য কি আছে? সেই ধারনা থেকেই বাংলা ডেমো টেক্সট তৈরীর চেষ্টা। HTML এর প্রয়োজনীয় প্রায় সব ফরম্যাটেই বাংলা ডেমো টেক্সট তুলে ধরা হয়েছে। আশা করছি, এরি ক্ষুদ্র প্রচেষ্টা আপনাদের কাজে আসবে।';

    const text3 =
        '১২০৫-১২০৬ খ্রিস্টাব্দের দিকে আমাকে ইখadadতিয়ার উদ্দিন মুহম্মদ বখতিয়ার খলজী নামের একজন তুর্কী বংশোদ্ভূত সেনাপতি রাজা লক্ষ্মণ সেনকে পরাজিত করে সেন রাজবংশের পতন ঘটান। ভিত্তিতে পুনর্বারবাংলা প্রদেশটিকে ভাগ করা হয়। পাকিস্তান এর প্রদেশ হিসাবে জন্ম নেয় পূর্ব পাকিস্তান';

    const text4 =
        '<ul><li>  ১২০৫-১২০৬ খ্রিস্টাব্দের দিকে ইখতিয়ার উদ্দিন মুহম্মদ বখতিয়ার খলজী নামের একজন তুর্কী বংশোদ্ভূত সেনাপতি রাজা লক্ষ্মণ সেনকে পরাজিত করে সেন রাজবংশের পতন ঘটান। </li><li> ১৭৫৭ খ্রিস্টাব্দে ব্রিটিশ ইস্ট ইন্ডিয়া কোম্পানি পলাশীর যুদ্ধে জয়লাভের মাধ্যমে বাংলার শাসনক্ষমতা দখল করে </li><li> ১৮৫৭ খ্রিস্টাব্দের সিপাহী বিপ্লবের পর কোম্পানির হাত থেকে বাংলার শাসনভার ব্রিটিশ সাম্রাজ্যের সরাসরি নিয়ন্ত্রণে আসে</li><li> ভারতীয় উপমহাদেশের দেশভাগের সময় ১৯৪৭ খ্রিস্টাব্দে ধর্ম গরিষ্ঠতার ভিত্তিতে পুনর্বার বাংলা প্রদেশটিকে ভাগ করা হয়। পাকিস্তান এর প্রদেশ হিসাবে জন্ম নেয় পূর্ব পাকিস্তান </li><li> ১৯৭১ সালে ৯ মাস ব্যাপী রক্তক্ষয়ী যুদ্ধের মাধ্যমে পাকিস্তানী হানাদার বাহিনীকে পরাজিত করে স্বাধীনতা লাভ করে বাংলাদেশ </li></ul>';

    const text5 =
        "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.";

    // pdf.addPage(Page(
    //     pageFormat: PdfPageFormat.a4,
    //     build: (Context context) =>
    //         Text(text1 + ' ' + text2 + ' ' + text3 + ' ' + text4 + ' ' + text5, isAnsiSupportedText: true)));

    pdf.addPage(
      Page(
        pageFormat: PdfPageFormat.a4,
        build: (Context context) => Table.fromTextArray(data: [
          <String>['ZvwiL', 'wcwWGd ms¯‹iY', 'A¨v‡µve¨vU ms¯‹iY'],
          <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
          <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
          <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
          <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
          <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
          <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
          <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
          <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
          <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
          <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
          <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
          <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
          <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
        ], headerTextType: TextType.ANSI),
      ),
    );

    pdf.addPage(
      Page(
        build: (context) {
          return Padding(
            padding: const EdgeInsets.only(
              left: 60,
              right: 60,
              bottom: 30,
            ),
            child: Column(
              children: [
                Spacer(),
                RichText(
                    text: TextSpan(children: [
                  TextSpan(
                    text: DateTime.now().year.toString() + '\n',
                    style: TextStyle(
                      fontWeight: FontWeight.bold,
                      color: PdfColors.grey600,
                      fontSize: 40,
                    ),
                  ),
                  TextSpan(
                    text: 'Portable Document Format',
                    style: TextStyle(
                      fontWeight: FontWeight.bold,
                      fontSize: 40,
                    ),
                  ),
                ])),
                Spacer(),
                Container(
                  alignment: Alignment.topRight,
                  height: 150,
                  child: PdfLogo(),
                ),
                Spacer(flex: 2),
                Align(
                  alignment: Alignment.topLeft,
                  child: UrlLink(
                    destination: 'https://wikipedia.org/wiki/PDF',
                    child: Text(
                      'https://wikipedia.org/wiki/PDF',
                      isAnsiSupportedText: true,
                      style: const TextStyle(
                        color: PdfColors.pink100,
                      ),
                    ),
                  ),
                ),
              ],
            ),
          );
        },
      ),
    );

    pdf.addPage(
      Page(
        orientation: PageOrientation.portrait,
        build: (context) {
          return Column(
            children: [
              Center(
                child: Text('Table of content', isAnsiSupportedText: false, style: Theme.of(context).header0),
              ),
              SizedBox(height: 20),
              TableOfContent(),
              Spacer(),
              Spacer(),
            ],
          );
        },
      ),
    );

    pdf.addPage(MultiPage(
        orientation: PageOrientation.portrait,
        crossAxisAlignment: CrossAxisAlignment.start,
        header: (Context context) {
          if (context.pageNumber == 1) {
            return SizedBox();
          }
          return Container(
              alignment: Alignment.centerRight,
              margin: const EdgeInsets.only(bottom: 3.0 * PdfPageFormat.mm),
              padding: const EdgeInsets.only(bottom: 3.0 * PdfPageFormat.mm),
              decoration: const BoxDecoration(border: Border(bottom: BorderSide(width: 0.5, color: PdfColors.grey))),
              child: Text('পোর্টেবল ডকুমেন্ট ফরম্যাট', isAnsiSupportedText: true
                  // style: Theme.of(context).defaultTextStyle.copyWith(color: PdfColors.grey)
                  ));
        },
        footer: (Context context) {
          return Container(
              alignment: Alignment.centerRight,
              margin: const EdgeInsets.only(top: 1.0 * PdfPageFormat.cm),
              child: Text('Page ${context.pageNumber} of ${context.pagesCount}',
                  style: Theme.of(context).defaultTextStyle.copyWith(color: PdfColors.grey)));
        },
        build: (Context context) => <Widget>[
              Header(
                  level: 0,
                  title: 'পোর্টেবল ডকুমেন্ট ফরম্যাট',
                  child: Row(mainAxisAlignment: MainAxisAlignment.spaceBetween, children: <Widget>[
                    Text('Portable Document Format', isAnsiSupportedText: true, textScaleFactor: 2),
                    PdfLogo()
                  ])),
              Text(
                'পোর্টেবল ডকুমেন্ট ফরম্যাট (পিডিএফ) হল একটি ফাইল ফরম্যাট যা অ্যাডোবি দ্বারা 1990-এর দশকে টেক্সট ফরম্যাটিং এবং ছবি সহ নথিগুলি উপস্থাপন করার জন্য তৈরি করা হয়েছিল, যা অ্যাপ্লিকেশন সফ্টওয়্যার, হার্ডওয়্যার এবং অপারেটিং সিস্টেম থেকে স্বাধীনভাবে। পোস্টস্ক্রিপ্ট ভাষার উপর ভিত্তি করে, প্রতিটি পিডিএফ ফাইল একটি ফিক্সড-লেআউট ফ্ল্যাট নথির একটি সম্পূর্ণ বিবরণ অন্তর্ভুক্ত করে, যার মধ্যে পাঠ্য, ফন্ট, ভেক্টর গ্রাফিক্স, রাস্টার চিত্র এবং এটি প্রদর্শনের জন্য প্রয়োজনীয় অন্যান্য তথ্য অন্তর্ভুক্ত রয়েছে। PDF 2008 সালে একটি ওপেন ফরম্যাট, ISO 32000 হিসাবে প্রমিত করা হয়েছিল এবং এর বাস্তবায়নের জন্য আর কোনো রয়্যালটি প্রয়োজন নেই।',
                isAnsiSupportedText: true,
              ),
              Text(
                'আজ, পিডিএফ ফাইলগুলিতে ফ্ল্যাট টেক্সট এবং গ্রাফিক্স ছাড়াও বিভিন্ন বিষয়বস্তু থাকতে পারে যার মধ্যে রয়েছে যৌক্তিক কাঠামোগত উপাদান, ইন্টারেক্টিভ উপাদান যেমন টীকা এবং ফর্ম-ক্ষেত্র, স্তর, সমৃদ্ধ মিডিয়া (ভিডিও সামগ্রী সহ) এবং U3D বা PRC ব্যবহার করে ত্রিমাত্রিক বস্তু, এবং বিভিন্ন অন্যান্য তথ্য বিন্যাস। পিডিএফ স্পেসিফিকেশন এনক্রিপশন এবং ডিজিটাল স্বাক্ষর, ফাইল সংযুক্তি এবং মেটাডেটাও প্রদান করে যাতে এই বৈশিষ্ট্যগুলির প্রয়োজনে ওয়ার্কফ্লো সক্ষম হয়।',
                isAnsiSupportedText: true,
              ),
              Header(level: 1, text: 'History and standardization'),
              Text(
                'আজ, পিডিএফ ফাইলগুলিতে ফ্ল্যাট টেক্সট এবং গ্রাফিক্স ছাড়াও বিভিন্ন বিষয়বস্তু থাকতে পারে যার মধ্যে রয়েছে যৌক্তিক কাঠামোগত উপাদান, ইন্টারেক্টিভ উপাদান যেমন টীকা এবং ফর্ম-ক্ষেত্র, স্তর, সমৃদ্ধ মিডিয়া (ভিডিও সামগ্রী সহ) এবং U3D বা PRC ব্যবহার করে ত্রিমাত্রিক বস্তু, এবং বিভিন্ন অন্যান্য তথ্য বিন্যাস। পিডিএফ স্পেসিফিকেশন এনক্রিপশন এবং ডিজিটাল স্বাক্ষর, ফাইল সংযুক্তি এবং মেটাডেটাও প্রদান করে যাতে এই বৈশিষ্ট্যগুলির প্রয়োজনে ওয়ার্কফ্লো সক্ষম হয়।',
                isAnsiSupportedText: true,
              ),
              Text(
                'আজ, পিডিএফ ফাইলগুলিতে ফ্ল্যাট টেক্সট এবং গ্রাফিক্স ছাড়াও বিভিন্ন বিষয়বস্তু থাকতে পারে যার মধ্যে রয়েছে যৌক্তিক কাঠামোগত উপাদান, ইন্টারেক্টিভ উপাদান যেমন টীকা এবং ফর্ম-ক্ষেত্র, স্তর, সমৃদ্ধ মিডিয়া (ভিডিও সামগ্রী সহ) এবং U3D বা PRC ব্যবহার করে ত্রিমাত্রিক বস্তু, এবং বিভিন্ন অন্যান্য তথ্য বিন্যাস। পিডিএফ স্পেসিফিকেশন এনক্রিপশন এবং ডিজিটাল স্বাক্ষর, ফাইল সংযুক্তি এবং মেটাডেটাও প্রদান করে যাতে এই বৈশিষ্ট্যগুলির প্রয়োজনে ওয়ার্কফ্লো সক্ষম হয়।',
                isAnsiSupportedText: true,
              ),
              Text(
                'আজ, পিডিএফ ফাইলগুলিতে ফ্ল্যাট টেক্সট এবং গ্রাফিক্স ছাড়াও বিভিন্ন বিষয়বস্তু থাকতে পারে যার মধ্যে রয়েছে যৌক্তিক কাঠামোগত উপাদান, ইন্টারেক্টিভ উপাদান যেমন টীকা এবং ফর্ম-ক্ষেত্র, স্তর, সমৃদ্ধ মিডিয়া (ভিডিও সামগ্রী সহ) এবং U3D বা PRC ব্যবহার করে ত্রিমাত্রিক বস্তু, এবং বিভিন্ন অন্যান্য তথ্য বিন্যাস। পিডিএফ স্পেসিফিকেশন এনক্রিপশন এবং ডিজিটাল স্বাক্ষর, ফাইল সংযুক্তি এবং মেটাডেটাও প্রদান করে যাতে এই বৈশিষ্ট্যগুলির প্রয়োজনে ওয়ার্কফ্লো সক্ষম হয়।',
                isAnsiSupportedText: true,
              ),
              Text(
                'আজ, পিডিএফ ফাইলগুলিতে ফ্ল্যাট টেক্সট এবং গ্রাফিক্স ছাড়াও বিভিন্ন বিষয়বস্তু থাকতে পারে যার মধ্যে রয়েছে যৌক্তিক কাঠামোগত উপাদান, ইন্টারেক্টিভ উপাদান যেমন টীকা এবং ফর্ম-ক্ষেত্র, স্তর, সমৃদ্ধ মিডিয়া (ভিডিও সামগ্রী সহ) এবং U3D বা PRC ব্যবহার করে ত্রিমাত্রিক বস্তু, এবং বিভিন্ন অন্যান্য তথ্য বিন্যাস। পিডিএফ স্পেসিফিকেশন এনক্রিপশন এবং ডিজিটাল স্বাক্ষর, ফাইল সংযুক্তি এবং মেটাডেটাও প্রদান করে যাতে এই বৈশিষ্ট্যগুলির প্রয়োজনে ওয়ার্কফ্লো সক্ষম হয়।',
                isAnsiSupportedText: true,
              ),
              Header(level: 1, text: 'Technical foundations'),
              Paragraph(text: 'The PDF combines three technologies:'),
              Header(level: 2, text: 'PostScript'),
              Text(
                'PostScript is a page description language run in an interpreter to generate an image, a process requiring many resources. It can handle graphics and standard features of programming languages such as if and loop commands. PDF is largely based on PostScript but simplified to remove flow control features like these, while graphics commands such as lineto remain.',
                isAnsiSupportedText: true,
              ),
              Text(
                'Often, the PostScript-like PDF code is generated from a source PostScript file. The graphics commands that are output by the PostScript code are collected and tokenized. Any files, graphics, or fonts to which the document refers also are collected. Then, everything is compressed to a single file. Therefore, the entire PostScript world (fonts, layout, measurements) remains intact.',
                isAnsiSupportedText: true,
              ),
              Header(level: 1, text: 'Content'),
              Text(
                'A PDF file is often a combination of vector graphics, text, and bitmap graphics. The basic types of content in a PDF are:',
                isAnsiSupportedText: true,
              ),
              Bullet(text: 'Text stored as content streams (i.e., not encoded in plain text)'),
              Bullet(text: 'Vector graphics for illustrations and designs that consist of shapes and lines'),
              Bullet(text: 'Raster graphics for photographs and other types of image'),
              Bullet(text: 'Multimedia objects in the document'),
              Text(
                'পরবর্তী পিডিএফ রিভিশনে, একটি পিডিএফ ডকুমেন্ট লিংক (ডকুমেন্ট বা ওয়েব পৃষ্ঠার ভিতরে), ফর্ম, জাভাস্ক্রিপ্ট (প্রাথমিকভাবে অ্যাক্রোব্যাট 3.0-এর জন্য প্লাগইন হিসাবে উপলব্ধ), বা প্লাগ-ইন ব্যবহার করে পরিচালনা করা যেতে পারে এমন অন্য যেকোনো ধরনের এমবেডেড বিষয়বস্তুকে সমর্থন করতে পারে।',
                isAnsiSupportedText: true,
              ),
              Text(
                'PDF 1.6 supports interactive 3D documents embedded in the PDF - 3D drawings can be embedded using U3D or PRC and various other data formats.',
                isAnsiSupportedText: true,
              ),
              Text(
                'একটি কম্পিউটার স্ক্রিনে একই রকম দেখতে দুটি পিডিএফ ফাইল খুব ভিন্ন আকারের হতে পারে। উদাহরণস্বরূপ, একটি উচ্চ রেজোলিউশন রাস্টার চিত্র একটি কম রেজোলিউশনের চেয়ে বেশি স্থান নেয়। সাধারণত নথিগুলিকে স্ক্রিনে প্রদর্শনের চেয়ে মুদ্রণের জন্য উচ্চতর রেজোলিউশনের প্রয়োজন হয়। অন্যান্য জিনিস যা ফাইলের আকার বাড়াতে পারে তা হল সম্পূর্ণ ফন্ট এমবেড করা, বিশেষ করে এশিয়াটিক স্ক্রিপ্টের জন্য, এবং গ্রাফিক্স হিসাবে পাঠ্য সংরক্ষণ করা।',
                isAnsiSupportedText: true,
              ),
              Header(level: 1, text: 'File formats and Adobe Acrobat versions'),
              Text(
                'পিডিএফ ফাইল ফরম্যাটটি বেশ কয়েকবার পরিবর্তিত হয়েছে এবং অ্যাডোব অ্যাক্রোব্যাটের নতুন সংস্করণ প্রকাশের সাথে সাথে বিকশিত হতে থাকে। পিডিএফের নয়টি সংস্করণ এবং সফ্টওয়্যারটির সংশ্লিষ্ট সংস্করণ রয়েছে:',
                isAnsiSupportedText: true,
              ),
              Table.fromTextArray(data: const <List<String>>[
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
                <String>['তারিখ', 'পিডিএফ সংস্করণ', 'অ্যাক্রোব্যাট সংস্করণ'],
                <String>['১৯৯৩', 'পিডিএফ 1.0', 'অ্যাক্রোব্যাট ১'],
                <String>['১৯৯৪', 'পিডিএফ 1.1', 'অ্যাক্রোব্যাট ২'],
                <String>['১৯৯৪', 'পিডিএফ 1.2', 'অ্যাক্রোব্যাট ৩'],
                <String>['১৯৯৪', 'পিডিএফ 1.3', 'অ্যাক্রোব্যাট ৪'],
                <String>['১৯৯৪', 'পিডিএফ 1.4', 'অ্যাক্রোব্যাট ৫'],
                <String>['১৯৯৪', 'পিডিএফ 1.5', 'অ্যাক্রোব্যাট ৬'],
                <String>['১৯৯৪', 'পিডিএফ 1.6', 'অ্যাক্রোব্যাট ৭'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৮'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ৯.১'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১০'],
                <String>['১৯৯৪', 'পিডিএফ 1.7', 'অ্যাক্রোব্যাট ১১'],
                <String>['১৯৯৪', 'পিডিএফ 2.0', 'অ্যাক্রোব্যাট ১২'],
              ], ansiSupportedCellIndexes: [
                // 0,
                2
              ]),
              Padding(padding: const EdgeInsets.all(10)),
              Text('পাঠ্য ক্রিয়েটিভ কমন্স অ্যাট্রিবিউশন শেয়ার অ্যালাইক লাইসেন্সের অধীনে উপলব্ধ।',
                  isAnsiSupportedText: true)
            ]));
  });

  tearDownAll(() async {
    final file = File('indic.pdf');
    await file.writeAsBytes(await pdf.save());
  });
}
